In [128]:
import pandas as pd
import matplotlib.pyplot as plt

In [129]:
sem1 = pd.read_csv("Sem1.csv")
sem2 = pd.read_csv("Sem2.csv")
sem3 = pd.read_csv("Sem3.csv")

In [130]:
sem1.head()

   ID        Name  Semester   Maths  English  Physics  Computer Science
0   1  Concettina          1     27       84       45                19
1   2        Burl          1     63       24       24                 8
2   3      Lebbie          1     93       80       75                51
3   4       Merci          1     72       68        8                41
4   5        Isak          1     37       99       79                26

In [131]:
sem2.head()

   ID       Name  Semester   Maths  English  Physics  Computer Science
0   1     Kelcie          2      5       14       14                40
1   2      Mayer          2      3       80       71                48
2   3      Bondy          2     66       64       54                 4
3   4     Muriel          2     11       37       98                10
4   5  Nickolaus          2     76       16        5                98

In [132]:
sem3.head()

   ID       Name  Semester   Maths  English  Physics  Computer Science
0   1    Parnell          3    100       31       58                87
1   2        Tad          3     48       17       77                50
2   3      Bunny          3     20       23       77                26
3   4    Demeter          3     80       88       40               100
4   5  Augustine          3     62       78       33                71

In [136]:
marksheet = pd.concat([sem1,sem2,sem3],axis=0)

In [137]:
marksheet

    ID        Name  Semester   Maths  English  Physics  Computer Science
0    1  Concettina          1     27       84       45                19
1    2        Burl          1     63       24       24                 8
2    3      Lebbie          1     93       80       75                51
3    4       Merci          1     72       68        8                41
4    5        Isak          1     37       99       79                26
..  ..         ...        ...    ...      ...      ...               ...
55  56       Chuck          3     50       91       58                47
56  57      Silvio          3     23       26       34                 1
57  58        Matt          3     18        1       84                10
58  59         Erv          3     64       14       13                10
59  60        Mack          3     86       25       42                79

[180 rows x 7 columns]

In [138]:
len(marksheet)

180

In [139]:
marksheet.drop("ID",axis=1,inplace=True)

In [140]:
from sklearn.utils import shuffle
marksheet = shuffle(marksheet)
marksheet.reset_index(drop=True, inplace=True)
marksheet

        Name  Semester   Maths  English  Physics  Computer Science
0     Manolo          1      2        3       67                31
1      Leigh          1     72       36       76                28
2    Matelda          3     14       41       31                16
3     Hersch          2     39       72      100                12
4      Mitch          1     83       97       99                73
..       ...        ...    ...      ...      ...               ...
175     Dani          3     82       33       72                88
176    Addia          3      9       49        2                52
177  Kendall          3     74       83        4                23
178      Kim          2     48       74       74                25
179     Rodd          3     27       44       29                70

[180 rows x 6 columns]

In [151]:
def calculation_marks(a):
 
    maths  = marksheet[marksheet["Semester "] == a & (marksheet["Maths"]>=30)]
    print(len(maths))
    cs  = marksheet[marksheet["Semester "] == a & (marksheet["English"]>=30)]
    english  = marksheet[marksheet["Semester "] == a & (marksheet["Physics"]>=30)]
    physics  = marksheet[marksheet["Semester "] == a & (marksheet["Maths"]>=30)]
    
    return len(maths), len(cs), len(english), len(physics)

In [152]:
maths_pass_sem1, cs_pass_sem1, english_pass_sem1, physics_pass_sem1 = calculation_marks(1)

maths_pass_sem3, cs_pass_sem3, english_pass_sem3, physics_pass_sem3 = calculation_marks(3)
#maths_pass, cs_pass, english_pass, physics_pass = calculation_marks("all")

37
37

In [153]:
maths_pass_sem2, cs_pass_sem2, english_pass_sem2, physics_pass_sem2 = calculation_marks(2)

0

In [123]:
maths_pass_sem2

0

115